In [80]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [81]:
df = pd.read_csv('data-folder/house_prices.csv')

In [82]:
df.head(5)

,Index,Title,Description,Amount(in rupees),Price (in rupees),location,Carpet Area,Status,Floor,Transaction,...,facing,overlooking,Society,Bathroom,Balcony,Car Parking,Ownership,Super Area,Dimensions,Plot Area
0,0,1 BHK Ready to Occupy Flat for sale in Srushti...,"Bhiwandi, Thane has an attractive 1 BHK Flat f...",42 Lac,6000.0,thane,500 sqft,Ready to Move,10 out of 11,Resale,...,NaN,NaN,Srushti Siddhi Mangal Murti Complex,1,2,NaN,NaN,NaN,NaN,NaN
1,1,2 BHK Ready to Occupy Flat for sale in Dosti V...,One can find this stunning 2 BHK flat for sale...,98 Lac,13799.0,thane,473 sqft,Ready to Move,3 out of 22,Resale,...,East,Garden/Park,Dosti Vihar,2,NaN,1 Open,Freehold,NaN,NaN,NaN
2,2,2 BHK Ready to Occupy Flat for sale in Sunrise...,Up for immediate sale is a 2 BHK apartment in ...,1.40 Cr,17500.0,thane,779 sqft,Ready to Move,10 out of 29,Resale,...,East,Garden/Park,Sunrise by Kalpataru,2,NaN,1 Covered,Freehold,NaN,NaN,NaN
3,3,1 BHK Ready to Occupy Flat for sale Kasheli,This beautiful 1 BHK Flat is available for sal...,25 Lac,NaN,thane,530 sqft,Ready to Move,1 out of 3,Resale,...,NaN,NaN,NaN,1,1,NaN,NaN,NaN,NaN,NaN
4,4,2 BHK Ready to Occupy Flat for sale in TenX Ha...,"This lovely 2 BHK Flat in Pokhran Road, Thane ...",1.60 Cr,18824.0,thane,635 sqft,Ready to Move,20 out of 42,Resale,...,West,"Garden/Park, Main Road",TenX Habitat Raymond Realty,2,NaN,1 Covered,Co-operative Society,NaN,NaN,NaN

##EDA

In [83]:
len(df.columns)

21

In [84]:
df.isnull().sum()

Index                     0
Title                     0
Description            3023
Amount(in rupees)         0
Price (in rupees)     17665
location                  0
Carpet Area           80673
Status                  615
Floor                  7077
Transaction              83
Furnishing             2897
facing                70233
overlooking           81436
Society              109678
Bathroom                828
Balcony               48935
Car Parking          103357
Ownership             65517
Super Area           107685
Dimensions           187531
Plot Area            187531
dtype: int64

In [85]:
df = df.drop(['Plot Area', 'Car Parking','Dimensions','Balcony','Super Area','Title','Society','Description','Status'],axis='columns')

In [86]:
# df.drop(['Dimensions'],axis=1,inplace=True)

In [87]:
# df["Plot Area"].value_counts()

In [88]:
# df.drop(['Plot Area'],axis=1,inplace=True)

In [89]:
df.head(5)

,Index,Amount(in rupees),Price (in rupees),location,Carpet Area,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Ownership
0,0,42 Lac,6000.0,thane,500 sqft,10 out of 11,Resale,Unfurnished,NaN,NaN,1,NaN
1,1,98 Lac,13799.0,thane,473 sqft,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,Freehold
2,2,1.40 Cr,17500.0,thane,779 sqft,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,Freehold
3,3,25 Lac,NaN,thane,530 sqft,1 out of 3,Resale,Unfurnished,NaN,NaN,1,NaN
4,4,1.60 Cr,18824.0,thane,635 sqft,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",2,Co-operative Society

In [90]:
df.isna().sum()

Index                    0
Amount(in rupees)        0
Price (in rupees)    17665
location                 0
Carpet Area          80673
Floor                 7077
Transaction             83
Furnishing            2897
facing               70233
overlooking          81436
Bathroom               828
Ownership            65517
dtype: int64

In [91]:
df["Price (in rupees)"] = df["Price (in rupees)"].transform(lambda x: x.fillna(x.mean()))

In [92]:
df.head(10)

,Index,Amount(in rupees),Price (in rupees),location,Carpet Area,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Ownership
0,0,42 Lac,6000.000000,thane,500 sqft,10 out of 11,Resale,Unfurnished,NaN,NaN,1,NaN
1,1,98 Lac,13799.000000,thane,473 sqft,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,Freehold
2,2,1.40 Cr,17500.000000,thane,779 sqft,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,Freehold
3,3,25 Lac,7583.771885,thane,530 sqft,1 out of 3,Resale,Unfurnished,NaN,NaN,1,NaN
4,4,1.60 Cr,18824.000000,thane,635 sqft,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",2,Co-operative Society
5,5,45 Lac,6618.000000,thane,NaN,2 out of 7,Resale,Unfurnished,East,"Garden/Park, Main Road",1,Co-operative Society
6,6,16.5 Lac,2538.000000,thane,550 sqft,4 out of 5,Resale,Unfurnished,NaN,NaN,1,NaN
7,7,60 Lac,10435.000000,thane,NaN,Ground out of 7,Resale,Furnished,NaN,NaN,1,NaN
8,8,60 Lac,10000.000000,thane,NaN,Ground out of 2,Resale,Furnished,NaN,NaN,1,Co-operative Society
9,9,1.60 Cr,11150.000000,thane,900 sqft,3 out of 27,Resale,Unfurnished,East,Garden/Park,3,Freehold

In [93]:
df.info()
df.shape
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Index              187531 non-null  int64
 1   Amount(in rupees)  187531 non-null  object
 2   Price (in rupees)  187531 non-null  float64
 3   location           187531 non-null  object
 4   Carpet Area        106858 non-null  object
 5   Floor              180454 non-null  object
 6   Transaction        187448 non-null  object
 7   Furnishing         184634 non-null  object
 8   facing             117298 non-null  object
 9   overlooking        106095 non-null  object
 10  Bathroom           186703 non-null  object
 11  Ownership          122014 non-null  object
dtypes: float64(1), int64(1), object(10)
memory usage: 17.2+ MB

Index                    0
Amount(in rupees)        0
Price (in rupees)        0
location                 0
Carpet Area          80673
Floor                 7077
Transaction             83
Furnishing            2897
facing               70233
overlooking          81436
Bathroom               828
Ownership            65517
dtype: int64

In [94]:
# df["Carpet Area"] = df["Carpet Area"].transform(lambda x: x.fillna(x.mean()))

def calculate_carpetArea():
  total = 0
  count = 0
  for i in df["Carpet Area"]:
    try:
      if i.lower() != "nan":
        total += int(i.split(" ")[0])
        count += 1
    except:
      pass
  return total, count

ca, count = calculate_carpetArea()
print(ca)
print(ca/count)
print(ca/df["Carpet Area"].count())

128207714
1199.7951861348706
1199.7951861348706

In [95]:
df['Carpet Area'] = df['Carpet Area'].transform(lambda x: x.fillna(float(ca/count)))

In [96]:
df["Carpet Area"] = df["Carpet Area"].astype(str).transform(lambda x: x.split(" ")[0])
df.head(10)

df["Carpet Area"] = df["Carpet Area"].astype(float)

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 12 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Index              187531 non-null  int64
 1   Amount(in rupees)  187531 non-null  object
 2   Price (in rupees)  187531 non-null  float64
 3   location           187531 non-null  object
 4   Carpet Area        187531 non-null  float64
 5   Floor              180454 non-null  object
 6   Transaction        187448 non-null  object
 7   Furnishing         184634 non-null  object
 8   facing             117298 non-null  object
 9   overlooking        106095 non-null  object
 10  Bathroom           186703 non-null  object
 11  Ownership          122014 non-null  object
dtypes: float64(2), int64(1), object(9)
memory usage: 17.2+ MB

In [98]:
df.head(7)

,Index,Amount(in rupees),Price (in rupees),location,Carpet Area,Floor,Transaction,Furnishing,facing,overlooking,Bathroom,Ownership
0,0,42 Lac,6000.000000,thane,500.000000,10 out of 11,Resale,Unfurnished,NaN,NaN,1,NaN
1,1,98 Lac,13799.000000,thane,473.000000,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,2,Freehold
2,2,1.40 Cr,17500.000000,thane,779.000000,10 out of 29,Resale,Unfurnished,East,Garden/Park,2,Freehold
3,3,25 Lac,7583.771885,thane,530.000000,1 out of 3,Resale,Unfurnished,NaN,NaN,1,NaN
4,4,1.60 Cr,18824.000000,thane,635.000000,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",2,Co-operative Society
5,5,45 Lac,6618.000000,thane,1199.795186,2 out of 7,Resale,Unfurnished,East,"Garden/Park, Main Road",1,Co-operative Society
6,6,16.5 Lac,2538.000000,thane,550.000000,4 out of 5,Resale,Unfurnished,NaN,NaN,1,NaN

In [99]:
df["Transaction"].value_counts()

Transaction
Resale          144172
New Property     42565
Other              709
Rent/Lease           2
Name: count, dtype: int64

In [100]:
def convert_rupees(amount_str):
    try:
        parts=amount_str.split()
        amount=float(parts[0])

        if len(parts)>1:
            unit=parts[1].strip()
            if unit=='Lac':
                amount*=100000
            elif unit=='Cr':
                amount*=10000000
        return amount
    except(ValueError,IndexError):
        return None

df['Amount(in rupees)']= df['Amount(in rupees)'].apply(convert_rupees)

In [101]:
df.rename(columns={'Amount(in rupees)': 'Amount_in_rupees', 'Price (in rupees)': 'Price_in_rupees', 'Carpet Area': 'Carpet_Area_in_sqft'}, inplace=True)

In [102]:
df.isnull().sum()

Index                      0
Amount_in_rupees        9684
Price_in_rupees            0
location                   0
Carpet_Area_in_sqft        0
Floor                   7077
Transaction               83
Furnishing              2897
facing                 70233
overlooking            81436
Bathroom                 828
Ownership              65517
dtype: int64

In [103]:
# df = df.drop(["Transaction", ""],axis='columns')

In [104]:
df.info()

dummies = pd.get_dummies(df.location,dummy_na=False,dtype=int)
df = pd.concat([df,dummies],axis='columns'  )

df.head(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 12 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Index                187531 non-null  int64
 1   Amount_in_rupees     177847 non-null  float64
 2   Price_in_rupees      187531 non-null  float64
 3   location             187531 non-null  object
 4   Carpet_Area_in_sqft  187531 non-null  float64
 5   Floor                180454 non-null  object
 6   Transaction          187448 non-null  object
 7   Furnishing           184634 non-null  object
 8   facing               117298 non-null  object
 9   overlooking          106095 non-null  object
 10  Bathroom             186703 non-null  object
 11  Ownership            122014 non-null  object
dtypes: float64(3), int64(1), object(8)
memory usage: 17.2+ MB

,Index,Amount_in_rupees,Price_in_rupees,location,Carpet_Area_in_sqft,Floor,Transaction,Furnishing,facing,overlooking,...,trivandrum,udaipur,udupi,vadodara,vapi,varanasi,vijayawada,visakhapatnam,vrindavan,zirakpur
0,0,4200000.0,6000.000000,thane,500.000000,10 out of 11,Resale,Unfurnished,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
1,1,9800000.0,13799.000000,thane,473.000000,3 out of 22,Resale,Semi-Furnished,East,Garden/Park,...,0,0,0,0,0,0,0,0,0,0
2,2,14000000.0,17500.000000,thane,779.000000,10 out of 29,Resale,Unfurnished,East,Garden/Park,...,0,0,0,0,0,0,0,0,0,0
3,3,2500000.0,7583.771885,thane,530.000000,1 out of 3,Resale,Unfurnished,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
4,4,16000000.0,18824.000000,thane,635.000000,20 out of 42,Resale,Unfurnished,West,"Garden/Park, Main Road",...,0,0,0,0,0,0,0,0,0,0
5,5,4500000.0,6618.000000,thane,1199.795186,2 out of 7,Resale,Unfurnished,East,"Garden/Park, Main Road",...,0,0,0,0,0,0,0,0,0,0
6,6,1650000.0,2538.000000,thane,550.000000,4 out of 5,Resale,Unfurnished,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
7,7,6000000.0,10435.000000,thane,1199.795186,Ground out of 7,Resale,Furnished,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
8,8,6000000.0,10000.000000,thane,1199.795186,Ground out of 2,Resale,Furnished,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0
9,9,16000000.0,11150.000000,thane,900.000000,3 out of 27,Resale,Unfurnished,East,Garden/Park,...,0,0,0,0,0,0,0,0,0,0

In [105]:
df["Bathroom"] = pd.to_numeric(df["Bathroom"], errors='coerce')

In [106]:
# df.drop('overlooking',axis='columns',inplace=True)

In [107]:
df.drop('location',axis='columns',inplace=True)

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 187531 entries, 0 to 187530
Data columns (total 92 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   Index                187531 non-null  int64
 1   Amount_in_rupees     177847 non-null  float64
 2   Price_in_rupees      187531 non-null  float64
 3   Carpet_Area_in_sqft  187531 non-null  float64
 4   Floor                180454 non-null  object
 5   Transaction          187448 non-null  object
 6   Furnishing           184634 non-null  object
 7   facing               117298 non-null  object
 8   overlooking          106095 non-null  object
 9   Bathroom             186668 non-null  float64
 10  Ownership            122014 non-null  object
 11  agra                 187531 non-null  int64
 12  ahmadnagar           187531 non-null  int64
 13  ahmedabad            187531 non-null  int64
 14  allahabad            187531 non-null  int64
 15  aurangabad           187531 non-null  int64
 16  badlapur             187531 non-null  int64
 17  bangalore            187531 non-null  int64
 18  belgaum              187531 non-null  int64
 19  bhiwadi              187531 non-null  int64
 20  bhiwandi             187531 non-null  int64
 21  bhopal               187531 non-null  int64
 22  bhubaneswar          187531 non-null  int64
 23  chandigarh           187531 non-null  int64
 24  chennai              187531 non-null  int64
 25  coimbatore           187531 non-null  int64
 26  dehradun             187531 non-null  int64
 27  durgapur             187531 non-null  int64
 28  ernakulam            187531 non-null  int64
 29  faridabad            187531 non-null  int64
 30  ghaziabad            187531 non-null  int64
 31  goa                  187531 non-null  int64
 32  greater-noida        187531 non-null  int64
 33  guntur               187531 non-null  int64
 34  gurgaon              187531 non-null  int64
 35  guwahati             187531 non-null  int64
 36  gwalior              187531 non-null  int64
 37  haridwar             187531 non-null  int64
 38  hyderabad            187531 non-null  int64
 39  indore               187531 non-null  int64
 40  jabalpur             187531 non-null  int64
 41  jaipur               187531 non-null  int64
 42  jamshedpur           187531 non-null  int64
 43  jodhpur              187531 non-null  int64
 44  kalyan               187531 non-null  int64
 45  kanpur               187531 non-null  int64
 46  kochi                187531 non-null  int64
 47  kolkata              187531 non-null  int64
 48  kozhikode            187531 non-null  int64
 49  lucknow              187531 non-null  int64
 50  ludhiana             187531 non-null  int64
 51  madurai              187531 non-null  int64
 52  mangalore            187531 non-null  int64
 53  mohali               187531 non-null  int64
 54  mumbai               187531 non-null  int64
 55  mysore               187531 non-null  int64
 56  nagpur               187531 non-null  int64
 57  nashik               187531 non-null  int64
 58  navi-mumbai          187531 non-null  int64
 59  navsari              187531 non-null  int64
 60  nellore              187531 non-null  int64
 61  new-delhi            187531 non-null  int64
 62  noida                187531 non-null  int64
 63  palakkad             187531 non-null  int64
 64  palghar              187531 non-null  int64
 65  panchkula            187531 non-null  int64
 66  patna                187531 non-null  int64
 67  pondicherry          187531 non-null  int64
 68  pune                 187531 non-null  int64
 69  raipur               187531 non-null  int64
 70  rajahmundry          187531 non-null  int64
 71  ranchi               187531 non-null  int64
 72  satara               187531 non-null  int64
 73  shimla               187531 non-null  int64
 74  siliguri             187531 non-null  int64
 75  solapur              187531 non-null  int64
 76  sonipat              187531 non-null  int64
 77  surat                187531 non-null  int64
 78  thane                187531 non-null  int64
 79  thrissur             187531 non-null  int64
 80  tirupati             187531 non-null  int64
 81  trichy               187531 non-null  int64
 82  trivandrum           187531 non-null  int64
 83  udaipur              187531 non-null  int64
 84  udupi                187531 non-null  int64
 85  vadodara             187531 non-null  int64
 86  vapi                 187531 non-null  int64
 87  varanasi             187531 non-null  int64
 88  vijayawada           187531 non-null  int64
 89  visakhapatnam        187531 non-null  int64
 90  vrindavan            187531 non-null  int64
 91  zirakpur             187531 non-null  int64
dtypes: float64(4), int64(82), object(6)
memory usage: 131.6+ MB

In [109]:
from sklearn.preprocessing import LabelEncoder
# Function to perform Label Encoding for multiple columns
def label_encode_multiple(df, columns):
    le = LabelEncoder()
    for column in columns:
        df[column] = le.fit_transform(df[column])
    return df

label_encode_columns = ['Transaction', 'Floor', 'Furnishing', 'facing', 'overlooking', 'Ownership']
df = label_encode_multiple(df, label_encode_columns)

In [110]:
df["Amount_in_rupees"] = df["Amount_in_rupees"].transform(lambda x: x.fillna(x.mean()))

In [111]:
df["Bathroom"] = df["Bathroom"].transform(lambda x: x.fillna(x.mean()))

In [112]:
cols = df.columns

In [113]:
# for col in cols:
#   print(col,df[col].isna().sum())

##Model building

In [114]:
from sklearn.linear_model import LinearRegression
from sklearn.svm import SVR
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestRegressor
from sklearn.neighbors import KNeighborsRegressor
from sklearn.ensemble import GradientBoostingRegressor
from xgboost import XGBRegressor
from sklearn.metrics import r2_score, mean_absolute_error, mean_squared_error
from sklearn.model_selection import train_test_split

In [115]:
X = df.drop('Amount_in_rupees',axis='columns')
Y = df.Amount_in_rupees

In [116]:
X["Price_in_rupees"].isna().sum()

np.int64(0)

In [117]:
x_train,x_test,y_train,y_test = train_test_split(X,Y,test_size=0.2,random_state=10)

In [118]:
# models = {
#     'Linear Regression': LinearRegression(),
#     'Decision Tree Regressor': DecisionTreeRegressor(),
#     'Random Forest': RandomForestRegressor(random_state=42),
#     'Knr': KNeighborsRegressor(),
#     'Gradient Boosting': GradientBoostingRegressor(random_state=42),
#     'XGBRegressor': XGBRegressor(),
#     # 'Support Vector Regressor': SVR()
# }

# for model_name, model in models.items():
#     model.fit(x_train, y_train)
#     y_pred = model.predict(x_test)

#     # Evaluate the model
#     r2 = r2_score(y_test, y_pred)
#     mae = mean_absolute_error(y_test, y_pred)
#     rmse = np.sqrt(mean_squared_error(y_test, y_pred))
#     scoree = model.score(x_test,y_test)

#     print(f'{model_name}:')
#     print(f'R-squared: {r2:.2f}')
#     print(f'Mean Absolute Error (MAE): {mae:.2f}')
#     print(f'Root Mean Squared Error (RMSE): {rmse:.2f}')
#     print(f'Accuracy of Model:{scoree:.2f}')
#     print('****************************************')

In [119]:
model = RandomForestRegressor(random_state=42)

model.fit(x_train, y_train)
y_pred = model.predict(x_test)

##Save the model

In [120]:
r2 = r2_score(y_test, y_pred)
mae = mean_absolute_error(y_test, y_pred)
rmse = np.sqrt(mean_squared_error(y_test, y_pred))
scoree = model.score(x_test,y_test)

In [121]:

print(f'R-squared: {r2:.2f}')
print(f'Mean Absolute Error (MAE): {mae:.2f}')
print(f'Root Mean Squared Error (RMSE): {rmse:.2f}')
print(f'Accuracy of Model:{scoree:.2f}')

R-squared: 0.91
Mean Absolute Error (MAE): 638052.71
Root Mean Squared Error (RMSE): 4233257.97
Accuracy of Model:0.91

In [124]:
import joblib

joblib.dump(model, "housePriceModel.pkl")

# Load the model
# loaded_model = joblib.load("housePriceModel.pkl")

['housePriceModel.pkl']